[{"parent": 9933918, "text": "If you want an excellent book about Commodore:<p><a href=\"http:&#x2F;&#x2F;www.amazon.com&#x2F;On-Edge-Spectacular-Rise-Commodore&#x2F;dp&#x2F;0973864907\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.com&#x2F;On-Edge-Spectacular-Rise-Commodore&#x2F;dp&#x2F;...</a>", "id": 9934512, "time": 1437638136, "type": "comment", "by": "walkingolof"}, {"kids": [9934328], "parent": 9933918, "text": "In 4th grade a friend got an Amiga. He boasted that it had 4096 colors, and we ridiculed him mercilessly. There aren&#x27;t that many colors! Can you name them?<p>We had our Apple IIs and TI-99&#x2F;4As with their 16 colors or less and couldn&#x27;t imagine anything greater.<p>Then we went to his house and saw Defender of the Crown, and we were humbled.", "id": 9934310, "time": 1437633136, "type": "comment", "by": "nsxwolf"}, {"parent": 9933918, "text": "I am so going to this! My 13yo son is going to be so excited to attend.", "id": 9934097, "time": 1437628297, "type": "comment", "by": "shawndumas"}, {"parent": 9933918, "text": "One can read &quot;The Future Was Here&quot;, to learn more about the platform and its contributors. <a href=\"https:&#x2F;&#x2F;mitpress.mit.edu&#x2F;books&#x2F;future-was-here\" rel=\"nofollow\">https:&#x2F;&#x2F;mitpress.mit.edu&#x2F;books&#x2F;future-was-here</a> - there&#x27;s also an accompanying website: <a href=\"http:&#x2F;&#x2F;amiga.filfre.net\" rel=\"nofollow\">http:&#x2F;&#x2F;amiga.filfre.net</a><p>Note that the Platform Studies series (<a href=\"http:&#x2F;&#x2F;www.platformstudies.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.platformstudies.com</a>) has exciting upcoming stuff.", "id": 9934191, "time": 1437630223, "type": "comment", "by": "foobarge"}, {"parent": 9934113, "text": "I was a power plant operator on a nuclear submarine. We were shown a classified film that about the SL-1 incident as part of our training. Recalling that film still gives me chills.<p>A lot was learned about reactor safety as result of that disaster.", "id": 9934316, "time": 1437633252, "type": "comment", "by": "MurMan"}, {"kids": [9934364, 9934367], "parent": 9934113, "text": "Does the Demon Core count as a reactor?", "id": 9934317, "time": 1437633253, "type": "comment", "by": "anabis"}, {"kids": [9934377, 9934390, 9934304, 9934355, 9934334], "parent": 9934113, "text": "&quot;...killed by the only fatal reactor accident in US history.&quot;<p>Is that really true?<p>&#x27;“Nobody died at Three Mile Island” — unless you count babies.&#x27;<p><a href=\"http:&#x2F;&#x2F;www.counterpunch.org&#x2F;2015&#x2F;03&#x2F;27&#x2F;cancer-and-infant-mortality-at-three-mile-island&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.counterpunch.org&#x2F;2015&#x2F;03&#x2F;27&#x2F;cancer-and-infant-mor...</a>", "id": 9934251, "time": 1437631496, "type": "comment", "by": "retrogradeorbit"}, {"parent": 9934113, "text": "That part of Idaho is interesting to drive through.  It&#x27;s near craters of the moon national park.  The Idaho Nuclear Laboratory is pretty big. I remember it being nearly 50 miles along one side of the road with all barbed wire fences. It&#x27;s pretty lonely and creepy out there.  There was one cliff in Atomic City that was covered with graffiti of large random numbers.  It turned out that the numbers were from high school graduating classes but the numbers weren&#x27;t in order so it seemed like some random code.", "id": 9934273, "time": 1437632179, "type": "comment", "by": "abecode"}, {"parent": 9934113, "text": "The SL-1 story is well known in the industry. The Atomic Energy Commission has a video.[1] SL-1 was an experimental reactor at the National Reactor Testing Station in Idaho, an 8000 square mile AEC reservation.  It&#x27;s an isolated area, and the test reactors were many miles apart, just in case.<p>[1] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qOt7xDKxmCM\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qOt7xDKxmCM</a>", "id": 9934314, "time": 1437633227, "type": "comment", "by": "Animats"}, {"parent": 9934113, "text": "I find the term &quot;accident&quot; a somewhat meaningless distinction. Millions of people have gotten cancer (statistically) from the radiation in the atmosphere as a result of nuclear tests.  Does it really matter that the tests were intentional or not?", "id": 9934417, "time": 1437636062, "type": "comment", "by": "JohnGB"}, {"parent": 9934113, "text": "For what it&#x27;s worth, I like the original title on the article better.", "id": 9934444, "time": 1437636442, "type": "comment", "by": "hudibras"}, {"parent": 9933757, "text": "I&#x27;d feel smug about my choice of cell phone but Samsung sponsored the Olympics.", "id": 9934491, "time": 1437637613, "type": "comment", "by": "billpg"}, {"kids": [9934464, 9934447], "parent": 9933757, "text": "This is why large companies should be more regulated. They should not be able to put pressure on labels or producers and get all the benefits. \nWhat Apple did by killing this startup is not ethical. Plus, by killing it, they tried to get a monopole. Microsoft got so many fines at the time because they had the monopole on PCs. If a large company tries to destroy startups just because they feel threatened, they should be penalised the same way Microsoft did (With huge fines) or I think of another way: forcing large companies to work with startups instead of shutting them down.", "id": 9934360, "time": 1437634765, "type": "comment", "by": "JohnyLy"}, {"parent": 9933757, "text": "Hint: when you start a service solving a <i>very generic</i> problem, you have a big chance of being outmaneuvered by a competitor.<p>Don&#x27;t cry if you fail.", "id": 9934494, "time": 1437637717, "type": "comment", "by": "amelius"}, {"kids": [9934384], "parent": 9933757, "text": "I kept waiting for the payoff, but the article never gave proof that Steve Jobs was behind it. Sounds to me like what happened is that Steve when negotiating with Warner Brothers said something like, &quot;How can you charge us those rates for your music when I have a whole list of places online that have it for free?&quot; At which point Warner said, &quot;We&#x27;ll take care of those. So the rates can stand.&quot;", "id": 9934365, "time": 1437634880, "type": "comment", "by": "dangero"}, {"parent": 9933757, "text": "This article reminds me of a lot of what Dalton Caldwell spoke about in his talk about why not to start a music startup at a Startup School in the last several years.<p>This business seems to have been run and have proceeded horribly, for the exact reasons that Caldwell and everyone else with experience in that area seems to be extremely familiar with.<p>Is there anything legitimately interesting to the &quot;Apple&quot; and &quot;Steve Jobs&quot; parts of this story other than the usual clickbait?", "id": 9934394, "time": 1437635446, "type": "comment", "by": "npp"}, {"kids": [9934403, 9934402], "parent": 9933757, "text": "I read this half asleep and a little inebriated but it seemed to evolve into some kind of bizarre self-aggrandizing pitch on how this Kasian Franks is a super-human with deep hard-to-duplicate knowledge and insights spanning multiple important and lucrative industries. Almost some kind of cred piece bolstered by his proxy encounter with Steve Jobs. Weird.", "id": 9934371, "time": 1437634947, "type": "comment", "by": "dxhdr"}, {"parent": 9933757, "text": "I actually like the second part of the article a lot more intriguing where he talks about his and the company&#x27;s personal background. It&#x27;s these stories that inspire to start a company.", "id": 9934385, "time": 1437635102, "type": "comment", "by": "Libermentix"}, {"parent": 9933757, "text": "TL;DR Music technology startups suck.", "dead": true, "id": 9934414, "time": 1437635958, "type": "comment", "by": "brianmcconnell"}, {"parent": 9933757, "text": "Whoever uses &quot;analyzation&quot; publicly deserves to have a failed start up.", "id": 9934435, "time": 1437636366, "type": "comment", "by": "jevgeni"}, {"kids": [9934471], "parent": 9933757, "text": "TL;DR Music technology startups suck.", "id": 9934413, "time": 1437635956, "type": "comment", "by": "brianmcconnell"}]